zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_sg00/pic32ck1025sg00144-pinctrl.h
#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

#define PC13A_EIC_EXTINT13 MCHP_PINMUX(c, 13, a, periph)

#define PC13C_SERCOM0_PAD3 MCHP_PINMUX(c, 13, c, periph)

#define PC13D_SERCOM2_PAD3 MCHP_PINMUX(c, 13, d, periph)

#define PC13M_CCL_OUT1 MCHP_PINMUX(c, 13, m, periph)

#define PC13N_PTC_DRV18 MCHP_PINMUX(c, 13, n, periph)

#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

#define PC14C_SERCOM2_PAD2 MCHP_PINMUX(c, 14, c, periph)

#define PC14E_EBI_A8 MCHP_PINMUX(c, 14, e, periph)

#define PC14K_PCC_DEN2 MCHP_PINMUX(c, 14, k, periph)

#define PC14N_PTC_DRV26 MCHP_PINMUX(c, 14, n, periph)

#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

#define PC15C_SERCOM2_PAD0 MCHP_PINMUX(c, 15, c, periph)

#define PC15D_SERCOM3_PAD3 MCHP_PINMUX(c, 15, d, periph)

#define PC15E_EBI_A6 MCHP_PINMUX(c, 15, e, periph)

#define PC15F_TCC1_WO0 MCHP_PINMUX(c, 15, f, periph)

#define PC15G_TCC1_WO4 MCHP_PINMUX(c, 15, g, periph)

#define PC15K_PCC_DATA8 MCHP_PINMUX(c, 15, k, periph)

#define PC15M_AC_CMP1 MCHP_PINMUX(c, 15, m, periph)

#define PC15N_PTC_DRV27 MCHP_PINMUX(c, 15, n, periph)

#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

#define PC16A_EIC_EXTINT0 MCHP_PINMUX(c, 16, a, periph)

#define PC16C_SERCOM2_PAD1 MCHP_PINMUX(c, 16, c, periph)

#define PC16E_EBI_A5 MCHP_PINMUX(c, 16, e, periph)

#define PC16F_TCC1_WO1 MCHP_PINMUX(c, 16, f, periph)

#define PC16K_PCC_DATA9 MCHP_PINMUX(c, 16, k, periph)

#define PC16N_PTC_DRV28 MCHP_PINMUX(c, 16, n, periph)

#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

#define PC17A_EIC_EXTINT1 MCHP_PINMUX(c, 17, a, periph)

#define PC17C_SERCOM2_PAD2 MCHP_PINMUX(c, 17, c, periph)

#define PC17E_EBI_A4 MCHP_PINMUX(c, 17, e, periph)

#define PC17F_TCC1_WO2 MCHP_PINMUX(c, 17, f, periph)

#define PC17K_PCC_DATA10 MCHP_PINMUX(c, 17, k, periph)

#define PC17N_PTC_DRV29 MCHP_PINMUX(c, 17, n, periph)

#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

#define PC18A_EIC_EXTINT2 MCHP_PINMUX(c, 18, a, periph)

#define PC18C_SERCOM2_PAD3 MCHP_PINMUX(c, 18, c, periph)

#define PC18E_EBI_A3 MCHP_PINMUX(c, 18, e, periph)

#define PC18F_TCC1_WO3 MCHP_PINMUX(c, 18, f, periph)

#define PC18K_PCC_DATA11 MCHP_PINMUX(c, 18, k, periph)

#define PC18N_PTC_DRV30 MCHP_PINMUX(c, 18, n, periph)

#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

#define PC19E_EBI_A2 MCHP_PINMUX(c, 19, e, periph)

#define PC19F_TCC1_WO4 MCHP_PINMUX(c, 19, f, periph)

#define PC19K_PCC_DATA12 MCHP_PINMUX(c, 19, k, periph)

#define PC19N_PTC_DRV31 MCHP_PINMUX(c, 19, n, periph)

#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

#define PC20A_EIC_EXTINT4 MCHP_PINMUX(c, 20, a, periph)

#define PC20E_EBI_NBS2_NWR2_A1 MCHP_PINMUX(c, 20, e, periph)

#define PC20F_TCC1_WO5 MCHP_PINMUX(c, 20, f, periph)

#define PC20K_PCC_DATA13 MCHP_PINMUX(c, 20, k, periph)

#define PC20N_PTC_DRV23 MCHP_PINMUX(c, 20, n, periph)

#define PC21_GPIO MCHP_PINMUX(c, 21, gpio, gpio)

#define PC21A_EIC_EXTINT5 MCHP_PINMUX(c, 21, a, periph)

#define PC21C_SERCOM2_PAD0 MCHP_PINMUX(c, 21, c, periph)

#define PC21G_TCC0_WO6 MCHP_PINMUX(c, 21, g, periph)

#define PC21K_PCC_DATA12 MCHP_PINMUX(c, 21, k, periph)

#define PC21M_AC_CMP0 MCHP_PINMUX(c, 21, m, periph)

#define PC22_GPIO MCHP_PINMUX(c, 22, gpio, gpio)

#define PC22A_EIC_EXTINT6 MCHP_PINMUX(c, 22, a, periph)

#define PC22C_SERCOM2_PAD1 MCHP_PINMUX(c, 22, c, periph)

#define PC22E_EBI_NWAIT MCHP_PINMUX(c, 22, e, periph)

#define PC22G_TCC0_WO7 MCHP_PINMUX(c, 22, g, periph)

#define PC22K_PCC_DATA13 MCHP_PINMUX(c, 22, k, periph)

#define PC22M_AC_CMP1 MCHP_PINMUX(c, 22, m, periph)

#define PC23_GPIO MCHP_PINMUX(c, 23, gpio, gpio)

#define PC23A_EIC_EXTINT7 MCHP_PINMUX(c, 23, a, periph)

#define PC23C_SERCOM2_PAD3 MCHP_PINMUX(c, 23, c, periph)

#define PC23E_EBI_NCS1 MCHP_PINMUX(c, 23, e, periph)

#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

#define PC24E_EBI_NWE_NWR0 MCHP_PINMUX(c, 24, e, periph)

#define PC24M_CCL_IN3 MCHP_PINMUX(c, 24, m, periph)

#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

#define PC25A_EIC_EXTINT9 MCHP_PINMUX(c, 25, a, periph)

#define PC25E_EBI_NCS0 MCHP_PINMUX(c, 25, e, periph)

#define PC25M_CCL_IN4 MCHP_PINMUX(c, 25, m, periph)

#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

#define PC26A_EIC_EXTINT10 MCHP_PINMUX(c, 26, a, periph)

#define PC26C_SERCOM2_PAD3 MCHP_PINMUX(c, 26, c, periph)

#define PC26E_EBI_A17 MCHP_PINMUX(c, 26, e, periph)

#define PC26M_CCL_IN5 MCHP_PINMUX(c, 26, m, periph)

#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

#define PC27E_EBI_A16 MCHP_PINMUX(c, 27, e, periph)

#define PC27M_CCL_OUT1 MCHP_PINMUX(c, 27, m, periph)

#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

#define PC28E_EBI_A23 MCHP_PINMUX(c, 28, e, periph)

#define PC28F_TCC1_WO6 MCHP_PINMUX(c, 28, f, periph)

#define PC29_GPIO MCHP_PINMUX(c, 29, gpio, gpio)

#define PC29A_EIC_EXTINT13 MCHP_PINMUX(c, 29, a, periph)

#define PC29E_EBI_NCS2 MCHP_PINMUX(c, 29, e, periph)

#define PC29F_TCC1_WO7 MCHP_PINMUX(c, 29, f, periph)

#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

#define PD2A_EIC_NMI MCHP_PINMUX(d, 2, a, periph)

#define PD2E_EBI_A19 MCHP_PINMUX(d, 2, e, periph)

#define PD2H_USB_SOF_1KHZ MCHP_PINMUX(d, 2, h, periph)

#define PD2K_PCC_DEN2 MCHP_PINMUX(d, 2, k, periph)

#define PD3_GPIO MCHP_PINMUX(d, 3, gpio, gpio)

#define PD3A_EIC_EXTINT3 MCHP_PINMUX(d, 3, a, periph)

#define PD3H_USB_DM MCHP_PINMUX(d, 3, h, periph)

#define PD4_GPIO MCHP_PINMUX(d, 4, gpio, gpio)

#define PD4A_EIC_EXTINT4 MCHP_PINMUX(d, 4, a, periph)

